Revit 2026 API

# ScheduleHeadingOrientation Enumeration

---

Orientation of schedule heading.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScheduleHeadingOrientation
```
```vb
Public Enumeration ScheduleHeadingOrientation
```
```cpp
public enum class ScheduleHeadingOrientation
```
```fsharp
type ScheduleHeadingOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 0 | Horizontal |
| Vertical | 1 | Vertical |

#### Reference

Autodesk.Revit.DB Namespace